---
kind: enumMember
id: F:Autodesk.Revit.DB.SolidCurveIntersectionMode.CurveSegmentsInside
enum: Autodesk.Revit.DB.SolidCurveIntersectionMode
source: html/a5221b6d-c361-3380-a87c-29e9abe33706.htm
---
# Autodesk.Revit.DB.SolidCurveIntersectionMode.CurveSegmentsInside

The results will include only curve segments inside the solid volume. This also will include curve segments coincident
 with the face(s) of the volume.